#Написати функцію, яка приймає два параметри: ім'я файлу та кількість символів.
#На екран повинен вивестись список із трьома блоками - символи з початку, із середини та з кінця файлу.
#Кількість символів в блоках - та, яка введена в другому параметрі.
#Придумайте самі, як обробляти помилку, наприклад, коли кількість символів більша, ніж є в файлі (наприклад, файл із двох символів і треба вивести по одному символу, то що виводити на місці середнього блоку символів?)
#В репозиторій додайте і ті файли, по яким робили тести.
#Як визначати середину файлу (з якої брать необхідні символи) - кількість символів поділити навпіл, а отримане "вікно" символів відцентрувати щодо середини файла і взяти необхідну кількість. В разі необхідності заокруглення одного чи обох параметрів - дивіться на свій розсуд.
import os.path

def func_name(name, length, a=False):
	if not os.path.isfile(name):
		print('Файл не знайдений')
		return
	f = open(name)
	file_length = len(f.read())
	f.seek(0)
	if length < 0:
		print('довжина має бути не відємною!')
		return
	if file_length < length:
		print('довжина більша за допустиму')
		return
	
	print(f'Перші {length} символи:\n{f.read(length)}')
	f.seek(file_length-length)
	print(f'Останні {length} символи:\n{f.read(length)}')
	print(f'Середні {length} символи:')
	if (file_length-length)%2 == 0:
		f.seek((file_length-length)/2)
		print(f.read(length))
		
	else:
		if a:
			f.seek(((file_length-length)/2)-1)
			print(f.read(length+1))
		else:
			f.seek(((file_length-length)/2)+1)
			print(f.read(length-1))
		
		
func_name('1.txt', 3, True)